org/how_to_brainstorm_great_business_ideas.org
:PROPERTIES:
:ID:       6ca1facb-6c47-4e2a-b115-a9898d3c1ed9
:END:
#+hugo_slug: how_to_brainstorm_great_business_ideas
#+roam_key: https://www.indiehackers.com/post/how-to-brainstorm-great-business-ideas-ab51c3d51c
#+title: How to brainstorm great business ideas

- tags :: [[id:242b8d43-d61d-4d41-b193-db903e181291][Business]]
- author :: [[id:a49e74c9-1a2e-4706-88d6-2fc646401c96][Courtland Allen]]

Executing the ideas require being strong in four main components:

1. The problem (aka the market)
2. The distribution channel to reach customers
3. The monetization model
4. The solution to the problem (aka the product or service)

* What makes a good problem?

1. A good problem is one that many people have. A good number to aim
   for is at least hundred thousand.
2. It is ideal if a group of people face the same problem (e.g. "developers")
3. Problem is growing: more people will face it in time to come
4. It's a good problem that people will pay money to solve

Always first search for a good problem. It may help to look at what
people are allready paying money for.

* Avoid Common Mistakes

1. Don't start with a solution in mind
2. Don't rule out already solved problems
3. Don't rule out high-value problems
4. Have a customer in mind

* Don't Skip Distribution

Knowing how to reach customers is important. There aren't many
channels to investigate, so go through them all. Some examples of
channels are:

- SEO
- press
- content marketing
- social media
- sales
- partnerships
- ads

* Thinking about solutions

- Solve problems in the opposite way of competitors
- Solutions should be built on first principles
- Product-market fit
  - Stripe focus heavily on API design and documentation, because its
    market is developers
- Product-distribution fit
