content/posts/how_to_brainstorm_great_business_ideas.md
+++
title = "How to brainstorm great business ideas"
author = ["Jethro Kuan"]
lastmod = 2020-06-07T17:27:09+08:00
slug = "how_to_brainstorm_great_business_ideas"
draft = false
+++

tags
: [Business]({{< relref "business" >}})

author
: [Courtland Allen]({{< relref "courtland_allen" >}})

Executing the ideas require being strong in four main components:

1.  The problem (aka the market)
2.  The distribution channel to reach customers
3.  The monetization model
4.  The solution to the problem (aka the product or service)

## What makes a good problem? {#what-makes-a-good-problem}

1.  A good problem is one that many people have. A good number to aim
    for is at least hundred thousand.
2.  It is ideal if a group of people face the same problem (e.g. "developers")
3.  Problem is growing: more people will face it in time to come
4.  It's a good problem that people will pay money to solve

Always first search for a good problem. It may help to look at what
people are allready paying money for.

## Avoid Common Mistakes {#avoid-common-mistakes}

1.  Don't start with a solution in mind
2.  Don't rule out already solved problems
3.  Don't rule out high-value problems
4.  Have a customer in mind

## Don't Skip Distribution {#don-t-skip-distribution}

Knowing how to reach customers is important. There aren't many
channels to investigate, so go through them all. Some examples of
channels are:

- SEO
- press
- content marketing
- social media
- sales
- partnerships
- ads

## Thinking about solutions {#thinking-about-solutions}

- Solve problems in the opposite way of competitors
- Solutions should be built on first principles
- Product-market fit
  - Stripe focus heavily on API design and documentation, because its
    market is developers
- Product-distribution fit
